[
    {
        "name": "Carmen Denson",
        "image": "img/TeamPhoto_Carmen.jpg",
        "location": "Bellingham, WA",
        "office": "360-937-0981",
        "cell": "360-319-5278",
        "email": "carmendenson@umpquabank.com",
        "nmls": "504887",
        "summery": "Carmen Denson is all about keeping things simple for her clients. As an Umpqua home loan officer, Carmen knows how to spot—and overcome—potential roadblocks so there are no surprises. She also believes in keeping the lines of communication open so you never have to wonder about your loan status. Besides helping out her clients, Carmen also helps out in her daughter’s classroom whenever she can."
    },
    {
        "name": "Channy Phoung",
        "image": "img/TeamPhoto_Channy.jpg",
        "location": "San Fransisco, CA",
        "office": "415-268-8058",
        "cell": "415-636-1055",
        "email": "channyphoung@umpquabank.com",
        "nmls": "1312914",
        "summery": "Channy Phoung has a background in biology but realized that her true calling was serving others—that’s why she became a home loan officer at Umpqua. These days, her focus is looking out for her customers’ best interests and structuring loans that best meet their needs. When she’s not going above and beyond for her clients, Channy helps out at local schools, empowering youth to pursue higher education."
    },
    {
        "name": "Idong Ekwere",
        "image": "img/TeamPhoto_Idong.jpg",
        "location": "Eugene, OR",
        "office": "541-349-8630",
        "cell": "541-912-0777",
        "email": "idongekwere@umpquabank.com",
        "nmls": "498668",
        "summery": "Idong Ekwere knows that a home purchase is one of the most significant purchases most people will make in their lifetime. As an Umpqua home loan officer, he enjoys being able to provide solutions that will allow his clients to buy, build, or refinance the home of their dreams. Idong’s encouraging attitude also comes in handy with the local Babe Ruth organization, where he regularly volunteers as a coach."
    },
    {
        "name": "Jennifer Leon",
        "image": "img/TeamPhoto_Jennifer.jpg",
        "location": "Portland, OR",
        "office": "503-219-6166",
        "cell": "503-449-6371",
        "email": "jenniferleon@umpquabank.com",
        "nmls": "417239",
        "summery": "Jennifer Leon has over 21 years of home lending experience under her belt. While she loves learning about her clients’ kids/pets/dreams, her favorite part of the job is de-stressing the home-buying process. “It can be overwhelming for people; I like to lift that burden for them,” she says. Jennifer’s knack for numbers also gets put to good use in her volunteer work as a grade-school math tutor."
    },
    {
        "name": "Joseph Portillo",
        "image": "img/TeamPhoto_Joseph.jpg",
        "location": "Beaverton, OR",
        "office": "503-291-6613",
        "cell": "503-539-0789",
        "email": "josephportillo@umpquabank.com",
        "nmls": "498755",
        "summery": "With over 11 years in home lending, Joseph Portillo specializes in home loans for first-time homebuyers and customers wanting to remodel or refinance their home. His favorite part of the job is making that phone call to tell his clients that the keys to their new home are ready and waiting. As a proud member of the Latino community, Joseph volunteers regularly for the Hacienda Community Development Corporation."
    },
    {
        "name": "Scott Fuller",
        "image": "img/TeamPhoto_Scott.jpg",
        "location": "Spokane, WA",
        "office": "509-893-3241",
        "cell": "509-879-6670",
        "email": "scottfuller@umpquabank.com",
        "nmls": "102381",
        "summery": "Scott Fuller became a home loan officer in 1996 and quickly realized how much he enjoys helping other people. He builds strong, lasting relationships with his clients and stands by them through every step of the lending process, from the first meeting to the final walk-through. A talented vocalist, Scott also volunteers for and performs in a non-profit gospel quartet."
    },
    {
        "name": "Tamra Hilkey",
        "image": "img/TeamPhoto_Tamra.jpg",
        "location": "Central Point, OR",
        "office": "541-618-6907",
        "cell": "541-441-2769",
        "email": "tamrahilkey@umpquabank.com",
        "nmls": "693949",
        "summery": "For some people, buying a home is a once-in-a-lifetime purchase; Tamra Hilkey thinks being part of that process is pretty special. She brings almost 10 years of home lending experience to the table, as well as a passion for exceptional service. When she’s not helping her clients, Tamra teaches financial literacy to the next generation as a volunteer for Junior Achievement."
    },
    {
        "name": "Todd McClure ",
        "image": "img/TeamPhoto_Todd.jpg",
        "location": "Portland, OR",
        "office": "503-460-0392",
        "cell": "503-752-0768",
        "email": "toddmcclure@umpquabank.com",
        "nmls": "502204",
        "summery": "Todd McClure has always enjoyed helping people reach their financial goals. One of his proudest accomplishments was working with a single mom for over a year, helping her get into a position to buy her own home. That’s just one of the good things Todd does for his community—he also regularly helps out around his Lloyd District neighborhood, volunteering for local children’s events and festivals."
    }
]